<template>
  <div class="view-muscle-guide" content>
    <div max-width>
      <h1>Руководство по работе с мышцами</h1>
      Вы хотите улучшить форму тела и проработать проблемные зоны? Нет проблем.
      Мы отсортировали упражнения в зависимости от того, на какие мышцы они
      воздействуют - посмотрите*. <br />* Однако если вы пропустили занятия по
      анатомии и являетесь абсолютным новичком в фитнесе, то вам стоит прочитать
      этот краткий справочник по мышцам. Здесь вы узнаете, где находится
      указанная мышца и почему ее следует тренировать.

      <h2>Верхняя часть тела</h2>
      Верхняя часть тела включает в себя разнообразные мышцы, и их развитие
      может быть важным аспектом для всех, не зависимо от пола. Эти мышцы
      помогают укрепить и поддержать верхнюю часть тела, а также придать ему
      более выразительную форму. Снизу представлено краткое описание.
      <br />
      <br />
      <masonry :cols="{ default: 2, 600: 1 }" gutter="20px">
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Бицепс"
          id="Bizeps"
          :dark="$store.getters.darkmode"
        >
          Эта мышца, расположенная в верхней части руки. Она является символом
          силы для многих. Бицепс состоит из двух главных мышечных пучков, их
          тренировка с равной интенсивностью важна, чтобы предотвратить
          дисбаланс силы в этой области и минимизировать риск развития проблем с
          мышцами.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Дельтовидная мышца"
          id="Deltamuskel"
          :dark="$store.getters.darkmode"
        >
          Дельтовидная мышца, относящаяся к группе мышц плеча и шеи, играет
          важную роль в формировании верхней части тела и поддержании контуров
          плечевого сустава. Она придает плечу его характерную форму, создавая
          визуальный акцент на самой внешней точке V-образной фигуры. Кроме
          того, дельтовидная мышца отвечает за движение руки в сторону. Если
          этой мышце не уделять достаточного внимания и не тренировать ее, это
          может привести к болям в верхней части руки и плеча.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Предплечье"
          id="Предплечье"
          :dark="$store.getters.darkmode"
        >
          Это область между локтем и кистью на верхней стороне руки. В ней
          находятся мышцы и сухожилия, которые играют важную роль в поддержании
          движений и функций руки и предплечья. Одной из этих мышц является
          мышца, которая может быть связана с "теннисным локтем". Это состояние
          характеризуется болями и воспалением в области локтевого сустава и
          связано с перегрузкой предплечья. Укрепление и правильный уход за
          мышцами предплечья могут помочь предотвратить такие проблемы и
          сохранить здоровье рук и предплечья.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Широчайшая мышца"
          id="Latissimus"
          :dark="$store.getters.darkmode"
        >
          Самая крупная скелетная мышца, находится на боковых частях спины.
          Тренировка этой мышцы помогает придать спине более широкий и
          мускулистый вид, что способствует достижению желаемой V-образной формы
          верхней части тела. Эта мышца играет важную роль в поддержании
          правильной осанки и обеспечивает множество движений спины, плеч и рук.
          Укрепление широчайшей мышцы может способствовать не только
          эстетическому улучшению, но и общему здоровью верхней части тела.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Большая грудная мышца"
          id="Pectoralis"
          :dark="$store.getters.darkmode"
        >
          Представляет собой мощную мышцу, которая расположена в передней части
          верхней половины торса. Эта мышца играет важную роль в поднимании и
          опускании рук, а также в разнообразных движениях плечевого сустава. Её
          развитие способствует формированию и укреплению верхней части груди,
          придавая ей более выразительную форму и контур.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Трапециевидная мышца"
          id="Trapezmuskel"
          :dark="$store.getters.darkmode"
        >
          Является крупной мышцей спины и шеи. Она состоит из верхней, средней и
          нижней частей, формируя треугольную форму на верхней части спины.
          Участвует в поднимании и опускании плеч, поворотах головы и шеи, а
          также в поддержании правильной осанки. Развитие этой мышцы может
          помочь укрепить верхнюю спину и шею, а также предотвратить напряжение
          и боли в этой области.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Трицепс"
          id="Trizeps"
          :dark="$store.getters.darkmode"
        >
          Представляет собой трёхглавую мышцу, расположенную на обратной стороне
          верхней части руки. Её составляют латеральная, медиальная и длинная
          головки, формируя характерный контур на задней части плеча. Он играет
          ключевую роль в разгибании предплечья и участвует во многих движениях
          верхней конечности. Развитие этой мышцы может помочь укрепить и
          придать форму задней части руки.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Передняя зубчатая мышца"
          id="Vorderer Sägemuskel"
          :dark="$store.getters.darkmode"
        >
          Располагается на боковой части груди и верхней части ребер. Она имеет
          вид "зубчатых" полос и выполняет важные функции при движениях рук. Эта
          мышца помогает поднимать и опускать руки, а также участвует в
          поворотах плеч и стабилизации лопаток. Ее развитие может
          способствовать укреплению верхней части тела и повышению общей
          функциональности плечевого пояса.
        </tc-card>
      </masonry>

      <h2>Нижняя часть тела</h2>
      Если у вас возникают трудности или вы хотите улучшить состояние области
      ниже живота, то важно ознакомиться с этими группами мышц
      <br />
      <br />
      <masonry :cols="{ default: 2, 600: 1 }" gutter="20px">
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Приводящие мышцы"
          id="Adduktor"
          :dark="$store.getters.darkmode"
        >
          Отвечают за движение бедра внутрь тела. Помогают поддерживать
          равновесие и участвуют в различных движениях бедра и тазового сустава.
          Играют важную роль в стабилизации таза. Их регулярная тренировка может
          способствовать улучшению общей стабильности нижней части тела.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Отводящая мышца"
          id="Abduktor"
          :dark="$store.getters.darkmode"
        >
          Эти мышцы играют роль в разгибании бедра в сторону и участвуют в
          поддержании баланса во время ходьбы и движений ногой. Развитие
          отводящих мышц способствует общей мобильности и стабильности нижней
          части тела.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Подколенные сухожилия"
          id="Beinbeuger"
          :dark="$store.getters.darkmode"
        >
          Находятся на задней стороне колена и связываются с икроножными
          мышцами. Играют важную роль в разгибании и поддержании структурной
          целостности колена. Развитие подколенных сухожилий помогает в
          поддержании мобильности колена и предотвращении травм данной области.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Ягодичная мышца"
          id="Gluteus Maximus"
          :dark="$store.getters.darkmode"
        >
          Находится в области ягодиц и состоит из большой, средней и маленькой
          головок. Эта мышца отвечает за разгибание бедра, повороты бедра наружу
          и стабилизацию тазового сустава. Развитие ягодичной мышцы может
          улучшить силу, стабильность и форму нижней части тела.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Тазовые мышцы"
          id="Unterer Rücken (Rückenstrecker)"
          :dark="$store.getters.darkmode"
        >
          Располагаются в области таза и играют важную роль в стабилизации
          тазовых костей. Эти мышцы поддерживают основу торса и участвуют в
          движениях тазового сустава. Их развитие способствует укреплению и
          контролю таза, улучшению стабильности нижней части тела и борьбе с
          болями в пояснице.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Икры"
          id="Rumpf"
          :dark="$store.getters.darkmode"
        >
          Состоят из мышц на задней стороне голени и ахиллова сухожилия. Эти
          мышцы помогают поднимать тело на носки, участвуют в движениях ходьбы и
          бега, а также в разгибании голеностопа. Их развитие и укрепление
          помогает в поддержании мобильности и предотвращении травм голеностопа.
        </tc-card>
        <tc-card
          :rounded="true"
          :shadow="false"
          title="Квадрицепс"
          id="Quadrizeps"
          :dark="$store.getters.darkmode"
        >
          Состоит из четырех головок мышцы и находится на передней стороне
          бедра. Эта группа мышц играет важную роль в разгибании коленного
          сустава и поддержании осанки. Его развитие способствует укреплению
          верхней части ног, улучшению мобильности и поддержанию структурной
          целостности колена.
        </tc-card>
      </masonry>
    </div>
  </div>
</template>

<script lang="ts">
import { Vue, Component } from 'vue-property-decorator';

@Component
export default class MuscleGuide extends Vue {}
</script>

<style lang="scss" scoped>
.view-muscle-guide {
  .tc-card {
    margin-bottom: 20px;
  }
}
</style>
